energySimpleFoam/MMS/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        smoother	DICGaussSeidel;
        tolerance       1e-11;
        relTol          0.01;
    }
    
    T
    {
        solver          smoothSolver;
        smoother	DILU;
        tolerance       1e-11;
        relTol          0.1;
    }

    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-11;
        relTol          0.1;
//	  solver          PBiCGStab;
//          preconditioner  DILU;
//          tolerance       1e-11;
//          relTol          0.1;
    }
}

SIMPLE	
{
    nNonOrthogonalCorrectors 0;
    momentumPredictor	yes;
    consistent		yes;
    
    residualControl
    {
    
    	p	1e-9;
    	U	1e-9;
    	T	1e-9;
    }
    
}

relaxationFactors
{
	equations
	{
		U	0.9;
		T	0.7;
	}
	
}		

// ************************************************************************* //
